* Build

#+BEGIN_SRC compile-queue
set -o errexit
set -o pipefail
set -o nounset
cd {{project_root}}
./gradlew :server:installDist
mv server/build/install/server/bin/kotlin-language-server /usr/local/bin/kotlin-language-server
mv server/build/install/server/lib/* /usr/local/lib/
#+END_SRC

#+RESULTS:
: > Task :shared:compileKotlin UP-TO-DATE
: > Task :shared:compileJava NO-SOURCE
: > Task :shared:processResources UP-TO-DATE
: > Task :shared:classes UP-TO-DATE
: > Task :shared:jar UP-TO-DATE
: > Task :shared:inspectClassesForKotlinIC UP-TO-DATE
: > Task :server:compileKotlin UP-TO-DATE
: > Task :server:compileJava NO-SOURCE
: > Task :server:processResources NO-SOURCE
: > Task :server:classes UP-TO-DATE
: > Task :server:jar UP-TO-DATE
: > Task :server:inspectClassesForKotlinIC UP-TO-DATE
: > Task :server:startScripts UP-TO-DATE
: > Task :server:installDist
: > Task :server:fixFilePermissions
: 
: Deprecated Gradle features were used in this build, making it incompatible with Gradle 8.0.
: 
: You can use '--warning-mode all' to show the individual deprecation warnings and determine if they come from your own scripts or plugins.
: 
: See https://docs.gradle.org/7.5/userguide/command_line_interface.html#sec:command_line_warnings
: 
: BUILD SUCCESSFUL in 1s
: 10 actionable tasks: 2 executed, 8 up-to-date

